swak4foam/Examples/groovyBC/movingConeDistorted/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleDyMFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.02;

deltaT          5e-06;

writeControl    timeStep;

writeInterval   40;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.2;

libs (
    "libOpenFOAM.so"
    "libgroovyBC.so"
    "libsimpleSwakFunctionObjects.so"
    "libswakFunctionObjects.so"
) ;

functions
{
    planeAverage
    {
        type swakExpression;
        valueType surface;
        surfaceName middlePlane;
        surface {
            type plane;
            basePoint       (0 0.00125 0);
            normalVector    (0 1 0);
            interpolate false;

            planeType pointAndNormal;
            pointAndNormalDict {
                point $..basePoint;
                normal $..normalVector;
            }
        }
        verbose true;
        expression "sum(pos().x*area())/sum(area())";
        accumulations (
            average
        );

        ignore_unimplemented_simpleFunctionObject::movePoints true;
    }
    flowThrough
    {
        type swakExpression;
        valueType surface;
        surfaceName middlePlane;
        verbose true;
        expression "U & Sf()";
        accumulations (
            sum
        );

        ignore_unimplemented_simpleFunctionObject::movePoints true;
    }
    flowThroughAlternate
    {
        type swakExpression;
        valueType surface;
        surfaceName middlePlane;
        verbose true;
        expression "U.y * area()";
        accumulations (
            sum
        );

        ignore_unimplemented_simpleFunctionObject::movePoints true;
    }
    yExtreme
    {
        type swakExpression;
        valueType surface;
        surfaceName control1;
        surface {
            type plane;
            basePoint       (-0.005 0 0);
            normalVector    (1 0 0);
            interpolate false;

            planeType pointAndNormal;
            pointAndNormalDict {
                point $..basePoint;
                normal $..normalVector;
            }
        }
        verbose true;
        expression "pos().y";
        accumulations (
            min
            max
        );

        ignore_unimplemented_simpleFunctionObject::movePoints true;
    }
    yFlow1
    {
        type swakExpression;
        valueType surface;
        surfaceName control1;
        verbose true;
        expression "U & Sf()";
        accumulations (
            sum
        );

        ignore_unimplemented_simpleFunctionObject::movePoints true;
    }
    yFlow2
    {
        type swakExpression;
        valueType surface;
        surfaceName control2;
        verbose true;
        expression "U & Sf()";
        surface {
            type plane;
            basePoint       (-0.007 0 0);
            normalVector    (1 0 0);
            interpolate false;
            planeType pointAndNormal;
            pointAndNormalDict {
                point $..basePoint;
                normal $..normalVector;
            }
        }
        accumulations (
            sum
        );

        ignore_unimplemented_simpleFunctionObject::movePoints true;
    }
    yFlow3
    {
        type swakExpression;
        valueType surface;
        surfaceName control3;
        surface {
            type plane;
            basePoint       (-0.002 0 0);
            normalVector    (1 0 0);
            interpolate false;
            planeType pointAndNormal;
            pointAndNormalDict {
                point $..basePoint;
                normal $..normalVector;
            }
        }
        verbose true;
        expression "U & Sf()";
        accumulations (
            sum
        );

        ignore_unimplemented_simpleFunctionObject::movePoints true;
    }
    cutTotal
    {
        type surfaces;
        outputControl outputTime;
        fields ( U );
        surfaceFormat vtk;
        surfaces (
            cuttingPlane {
                type cuttingPlane;
                planeType pointAndNormal;
                pointAndNormalDict {
                    basePoint       (0 0.00125 0);
                    normalVector    (0 1 0);
                }
                interpolate false;
            }
            normalPlane {
                type plane;
                basePoint       (0 0.00125 0);
                normalVector    (0 1 0);
                interpolate false;
                planeType pointAndNormal;
                pointAndNormalDict {
                    basePoint       (0 0.00125 0);
                    normalVector    (0 1 0);
                }
            }
        );
        interpolationScheme nix;
    }
    // whatIsHere {
    //     type listRegisteredObjects;
    //     ignore_unimplemented_simpleFunctionObject::movePoints true;
    // }
    meshMovement
    {
        type swakExpression;
        valueType internalField;
        verbose true;
        expression "(meshPhi(U)-phi)/area()";
        accumulations (
            min
            max
            sum
        );

        ignore_unimplemented_simpleFunctionObject::movePoints true;
    }
}

// ************************************************************************* //
